In [2]:
import pandas as pd

In [3]:
data = {
    '도시': ['서울', '서울', '부산', '부산'],
    '년도': [2021,2022, 2021, 2022],
    '인구수': [9700000, 9720000, 3400000, 3450000]
}

In [4]:
df = pd.DataFrame(data)

In [5]:
df_multi_index = df.set_index(["도시","년도"])

In [6]:
df_multi_index

             인구수
도시 년도
서울 2021  9700000
   2022  9720000
부산 2021  3400000
   2022  3450000

In [7]:
df

   도시    년도      인구수
0  서울  2021  9700000
1  서울  2022  9720000
2  부산  2021  3400000
3  부산  2022  3450000

In [10]:
# 멀티 인덱스를 튜플로 직접 생성
index = pd.MultiIndex.from_tuples([('서울', 2021), ('서울', 2022), ('부산', 2021), ('부산', 2022)], names=['도시', '년도'])

# 데이터프레임에 적용
df_multi_index = pd.DataFrame({'인구수': [9700000, 9720000, 3400000, 3450000]}, index=index)
print(df_multi_index)

             인구수
도시 년도
서울 2021  9700000
   2022  9720000
부산 2021  3400000
   2022  3450000

In [11]:
df_multi_index.loc["서울",2021]

인구수    9700000
Name: (서울, 2021), dtype: int64

In [12]:
# 데이터프레임 생성
data = {
    '도시': ['서울', '서울', '부산', '부산', '서울', '부산'],
    '년도': [2021, 2022, 2021, 2022, 2021, 2022],
    '인구수': [9700000, 9720000, 3400000, 3450000, 9800000, 3500000],
    '소득': [60000, 62000, 45000, 46000, 63000, 47000]
}
df = pd.DataFrame(data)

# '도시'와 '년도'를 기준으로 그룹화하여 평균 계산
grouped_df = df.groupby(['도시', '년도']).mean()
print(grouped_df)

               인구수       소득
도시 년도
부산 2021  3400000.0  45000.0
   2022  3475000.0  46500.0
서울 2021  9750000.0  61500.0
   2022  9720000.0  62000.0

In [15]:
grouped = df.groupby(['도시','년도']).mean()
print("\n그룹화한 데이터:")
print(grouped)

그룹화한 데이터:
               인구수       소득
도시 년도
부산 2021  3400000.0  45000.0
   2022  3475000.0  46500.0
서울 2021  9750000.0  61500.0
   2022  9720000.0  62000.0

In [16]:
grouped.loc['서울']

            인구수       소득
년도
2021  9750000.0  61500.0
2022  9720000.0  62000.0